Revit 2026 API

# AdvancedLossFactor(AdvancedLossFactor) Constructor

---

Creates a copy of the given advanced loss factor object

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public AdvancedLossFactor(
	AdvancedLossFactor other
)
```
```vb
Public Sub New (
	other As AdvancedLossFactor
)
```
```cpp
public:
AdvancedLossFactor(
	AdvancedLossFactor^ other
)
```
```fsharp
new :
        other : AdvancedLossFactor -> AdvancedLossFactor
```

#### Parameters

other AdvancedLossFactor

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

AdvancedLossFactor Class

AdvancedLossFactor Overload

Autodesk.Revit.DB.Lighting Namespace